Documents/упВводНачальныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упВводНачальныхОстатков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упАгрегатыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.упОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСклады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперацииВводаНачальныхОстатков</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыОперацийВводаНачальныхОстатков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Агрегаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Агрегат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упШиныУзлыИАгрегаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительноеОборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДополнительноеОборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упЗапчасти</v8:Type>
								<v8:Type>cfg:CatalogRef.упГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упЗаправкаСливГСМ</v8:Type>
								<v8:Type>cfg:DocumentRef.упПоступлениеМатериалов</v8:Type>
								<v8:Type>cfg:DocumentRef.упКорректировкаОстатковМатериалов</v8:Type>
								<v8:Type>cfg:DocumentRef.упПутевойЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Comment>Сумма в валюте управленческого учета, без НДС </Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Comment>Сумма в валюте управленческого учета, с НДС </Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/упАгрегатыТранспортныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упАгрегатыТранспортныхСредств</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыОперацийМонтажа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХодоваяШина</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Агрегат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упШиныУзлыИАгрегаты</v8:Type>
						<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/упАгрегатыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упАгрегатыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Агрегат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упШиныУзлыИАгрегаты</v8:Type>
						<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСклады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/упТипыОперацийВводаНачальныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыОперацийВводаНачальныхОстатков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОстаткиАгрегатовНаСкладах</Name>
					<Comment>Ввод начальных остатков агрегатов на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстаткиМатериаловНаСкладах</Name>
					<Comment>Ввод начальных остатков материалов на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстаткиОборудованияНаСкладах</Name>
					<Comment>Ввод начальных остатков по дополнительному оборудованию на складах</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упТипыОперацийМонтажа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыОперацийМонтажа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Установлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Снято</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/упВводНачальныхОстатков/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Изменил = упСервисныеФункцииКлиентСервер.АвторПоследнегоИзмененияОбъекта(ДополнительныеСвойства);	

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	Документы.упВводНачальныхОстатков.ИнициализироватьДанныеДокумента(ЭтотОбъект, ДополнительныеСвойства);
	
	РеквизитыОбъекта = Новый Структура("Дата,
								|Организация,
								|Валюта,
								|Склад");
	
	ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, ЭтотОбъект);
		
	// Формирование движений по регистру накопления "упОстаткиМатериалов"
	упУправлениеЗапасами.СформироватьДвиженияОстаткиМатериалов(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
		
	// Формирование движений по регистру накопления "упАгрегатыНаСкладах"
	упУправлениеЗапасами.СформироватьДвиженияАгрегатов(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	Движения.Записать();
	
	ПроверитьОстаткиАгрегатовИДопОборудования(Отказ);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТипОперацииВводаНачальныхОстатков = Перечисления.упТипыОперацийВводаНачальныхОстатков.ОстаткиАгрегатовНаСкладах Тогда 
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ДополнительноеОборудование.ДополнительноеОборудование");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ДополнительноеОборудование.Количество");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Материалы.Количество");
		
	ИначеЕсли ТипОперацииВводаНачальныхОстатков = Перечисления.упТипыОперацийВводаНачальныхОстатков.ОстаткиОборудованияНаСкладах Тогда 
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Агрегаты.Агрегат");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Агрегаты.Количество");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Материалы.Количество");
		
	ИначеЕсли ТипОперацииВводаНачальныхОстатков = Перечисления.упТипыОперацийВводаНачальныхОстатков.ОстаткиМатериаловНаСкладах Тогда 
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Агрегаты.Агрегат");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Агрегаты.Количество");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ДополнительноеОборудование.ДополнительноеОборудование");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ДополнительноеОборудование.Количество");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьОстаткиАгрегатовИДопОборудования(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"
	|//{Запрос: 0 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	Агрегаты.Агрегат КАК Агрегат,
	|	Агрегаты.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ втНачальныеОстатки
	|ИЗ
	|	Документ.упВводНачальныхОстатков.Агрегаты КАК Агрегаты
	|ГДЕ Агрегаты.Ссылка = &ВводНачальныхОстатков
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	ДопОборудование.ДополнительноеОборудование КАК Агрегат,
	|	ДопОборудование.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.упВводНачальныхОстатков.ДополнительноеОборудование КАК ДопОборудование
	|ГДЕ ДопОборудование.Ссылка = &ВводНачальныхОстатков
	|;
	|//{Запрос: 1 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНачальныеОстаткиТ.Агрегат КАК Агрегат,
	|	втНачальныеОстаткиТ.НомерСтроки КАК НомерСтроки,
	|	АгрегатыТранспортныхСредств.ТранспортноеСредство КАК ТранспортноеСредство
	|ИЗ
	|	втНачальныеОстатки КАК втНачальныеОстаткиТ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упАгрегатыТранспортныхСредств.СрезПоследних(
	|		&Период,
	|		) КАК АгрегатыТранспортныхСредств
	|	ПО ИСТИНА
	|		И втНачальныеОстаткиТ.Агрегат = АгрегатыТранспортныхСредств.Агрегат
	|		И ЗНАЧЕНИЕ(Перечисление.упТипыОперацийМонтажа.Установлено) = АгрегатыТранспортныхСредств.Операция
	|;
	|//{Запрос: 2 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНачальныеОстаткиТ.Агрегат КАК Агрегат,
	|	втНачальныеОстаткиТ.НомерСтроки КАК НомерСтроки,
	|	АгрегатыНаСкладах.Склад КАК Склад
	|ИЗ
	|	втНачальныеОстатки КАК втНачальныеОстаткиТ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.упАгрегатыНаСкладах.Остатки(
	|		&Период,
	|		Склад <> &Склад) КАК АгрегатыНаСкладах
	|	ПО АгрегатыНаСкладах.Агрегат = втНачальныеОстаткиТ.Агрегат
	|";
	Запрос.УстановитьПараметр("ВводНачальныхОстатков", Ссылка);	
	Запрос.УстановитьПараметр("Период", Дата);	
	Запрос.УстановитьПараметр("Склад", Склад);	
	
	мсвРезультат = Запрос.ВыполнитьПакет();
	
	Если НЕ мсвРезультат[1].Пустой() Тогда
		Выборка = мсвРезультат[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если ТипОперацииВводаНачальныхОстатков = Перечисления.упТипыОперацийВводаНачальныхОстатков.ОстаткиАгрегатовНаСкладах Тогда
				
				ТекстСообщения = Нстр("ru = 'Агрегат ""%1"" установлен на %2'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,  Выборка.Агрегат, Выборка.ТранспортноеСредство);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Агрегаты", Выборка.НомерСтроки , "Агрегат"));
				
			ИначеЕсли ТипОперацииВводаНачальныхОстатков = Перечисления.упТипыОперацийВводаНачальныхОстатков.ОстаткиОборудованияНаСкладах Тогда
				
				ТекстСообщения = Нстр("ru = 'Доп. оборудование ""%1"" установлено на %2'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,  Выборка.Агрегат, Выборка.ТранспортноеСредство);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДополнительноеОборудование", Выборка.НомерСтроки , "ДополнительноеОборудование"));
				
			КонецЕсли;			
					
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ввод начальных остатков'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),	УровеньЖурналаРегистрации.Предупреждение,,, ТекстСообщения);
									
		КонецЦикла;	
	КонецЕсли;
	
	Если НЕ мсвРезультат[2].Пустой() Тогда
		Выборка = мсвРезультат[2].Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ТипОперацииВводаНачальныхОстатков = Перечисления.упТипыОперацийВводаНачальныхОстатков.ОстаткиАгрегатовНаСкладах Тогда
				
				ТекстСообщения = Нстр("ru = 'Агрегат ""%1"" находится на складе %2'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,  Выборка.Агрегат, Выборка.Склад);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Агрегаты", Выборка.НомерСтроки , "Агрегат"));
				
			ИначеЕсли ТипОперацииВводаНачальныхОстатков = Перечисления.упТипыОперацийВводаНачальныхОстатков.ОстаткиОборудованияНаСкладах Тогда
				
				ТекстСообщения = Нстр("ru = 'Доп. оборудование ""%1"" находится на складе %2'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,  Выборка.Агрегат, Выборка.Склад);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДополнительноеОборудование", Выборка.НомерСтроки , "ДополнительноеОборудование"));
				
			КонецЕсли;			
					
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ввод начальных остатков'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),	УровеньЖурналаРегистрации.Предупреждение,,, ТекстСообщения);
		КонецЦикла;	
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
